In [3]:
import pandas as pd

df = pd.read_csv('items.csv')
df

       name  price  quantity
0     Phone    100         5
1    Laptop   1000         3
2     Cable     10         5
3     Mouse     50         5
4  Keyboard     75         5

In [4]:
import requests
from io import StringIO

url = "https://people.sc.fsu.edu/~jburkardt/data/csv/airtravel.csv"
headers = {"User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10.14; rv:66.0) Gecko/20100101 Firefox/66.0"}
req = requests.get(url,headers=headers)
data = StringIO(req.text)

df = pd.read_csv(data)
df

   Month   "1958"   "1959"   "1960"
0    JAN      340      360      417
1    FEB      318      342      391
2    MAR      362      406      419
3    APR      348      396      461
4    MAY      363      420      472
5    JUN      435      472      535
6    JUL      491      548      622
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432